import { Section } from "../../usableComponents/Section"
import { Wraper } from "../../usableComponents/Wraper"
import s from '../politic/Politic.module.scss'

export const СontractOferta: React.FC = () => {
    return (
        <Wraper>
            <Section>
                <div className={s.wrap}>
                    Договор публичной оферты
                    <br />
                    <p>
                        1. Общие положения <br />
                        1.1. Настоящий Публичный договор (далее – Оферта, договор) представляет собой официальное предложение «Исполнителя» на сайте по оказанию информационно-консультационных услуг юридическим и/или дееспособным физическим лицам (далее – Заказчик) на  вебсайте  направленном на приобретение Заказчиком дополнительных знаний, умений и навыков в определенной сфере деятельности.
                        1.2. Принятие (акцепт) данной Оферты означает полное и безоговорочное принятие Заказчиком всех условий без каких-либо исключений и/или ограничений и приравнивается в соответствии с ч. 2 ст. 642 Гражданского кодекса Украины (далее ГК Украины) к заключению сторонами двухстороннего письменного договора на условиях, которые изложены ниже в этой Оферте.
                        1.3. Данный Публичный договор на оказание информационно-консультационных услуг на вебсайте (Оферта) считается заключенным (акцептированным) с момента заполнения Заказчиком учетной записи на Сайте Исполнителя и поступления денежных средств Заказчика на расчетный счет Исполнителя.
                        1.4. Исполнитель и Заказчик предоставляют взаимные гарантии своей право- и дееспособности необходимые для заключения и исполнения настоящего Договора на оказание услуг по организации участия в Форуме.
                    </p>


                    <p>
                        1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ
                        <br />
                        1.1 В настоящей Политике конфиденциальности используются следующие термины:

                        1.1.1. «Администрация сайта (далее – Администрация сайта) » – уполномоченные сотрудники на управления сайтом, которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.

                        1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).

                        1.1.3. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.

                        1.1.4. «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.

                        1.1.5. «Пользователь сайта Интернет-магазина (далее ? Пользователь)» – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт интернет-магазина.

                        1.1.6. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.

                        1.1.7. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.

                    </p>

                    <p>
                        2. Определения и термины <br />
                        2.1 В целях настоящей Оферты нижеприведенные термины используются в следующем значении:
                        Оферта – настоящий публичный договор на оказание информационно-консультационных услуг на Украинском маркетинг-форуме.
                        Сайт – интернет-сайт используемый Исполнителем на правах собственности или другая онлайн-платформа, которую Исполнитель будет использовать согласно соответствующего Договора.
                        Услуги по информационно-консультационным услугам на сайте– любые услуги Исполнителя, виды и стоимость которых определена на Сайте, по предоставлению ограниченного доступа Заказчика к услугам, предлагаемым на сайте в соответствии с условиями Оферты для оказания информационно-консультационных услуг на сайте.
                        Акцепт Оферты – полное и безоговорочное принятие Оферты путем осуществления действий по 100% предварительной оплате за информационно-консультационные услуги на сайте.
                        Исполнитель – физическое и/или юридическое лицо, имеющее право предоставить информационно-консультационные услуги Заказчику на условиях настоящей Оферты.
                        Заказчик – лицо, осуществившее Акцепт Оферты на изложенных в ней условиях.

                    </p>


                    <p>
                        3. Предмет оферты
                        <br />
                        3.1. Предметом настоящей Оферты является оказание Заказчику информационно-консультационных услуг на сайте силами Исполнителя в соответствии с условиями настоящей Оферты за вознаграждение, выплачиваемое Заказчиком Исполнителю.
                        Услуги оказываются путем предоставления Заказчику доступа к онлайн видео-трансляции Украинского маркетинг-форума и контента (аудиовизуальных информационных материалов) с возможностью общения в режиме реального времени в формате онлайн-чата. Участие в Украинском маркетинг-форуме осуществляется Заказчиком путем использования компьютерного устройства Заказчика (смартфон, планшет, ноутбук, ПК и т.д.), который подключен к сети «Интернет» и имеет доступ к соответствующей онлайн-платформе.
                        3.2. Стоимость каждого вида информационно-консультационных услуг на Украинском маркетинг-форуме устанавливается на Сайте Исполнителя. Данный договор на оказание услуг считается заключенным с момента поступления денежных средств на расчетный счет Исполнителя.
                        3.3. Платежи по настоящему договору осуществляется одним из способов предлагаемых Заказчику при нажатии кнопки «Оплатить»
                        3.4. Заполнение Заказчиком соответствующей заявки и внесение оплаты одним из способов, указанных на Сайте является подтверждением Заказчика на получение информационно-консультационных услуг на сайте.
                        3.5. В случае, возникновения вопросов или за дополнительной информацией Заказчик может обратиться в службу поддержки Исполнителя по адресу:
                        3.6. Настоящая Оферта имеет силу акта об оказании слуг. Приемка производится без подписания соответствующего акта.

                    </p>


                    <p>
                        4. Обязанности и права Исполнителя <br />
                        4.1. Оказать Заказчику Услуги в соответствии с условиями настоящей Оферты.
                        4.2. Своевременно извещать Заказчика обо всех ситуациях, требующих дополнительного согласования.
                        4.3. Исполнитель имеет право в любой момент изменять условия настоящей публичной Оферты в одностороннем порядке без предварительного согласования с Заказчиком, обеспечивая при этом публикацию измененных условий на информационной доске не менее чем за один день до их ввода в действие. Данные изменения не имеют обратной силы и не распространяются на услуги, оплаченные Заказчиком.
                        4.4. Исполнитель оставляет за собой право осуществлять замену преподавателя в случае его болезни без предварительного уведомления Заказчика.
                        4.5. В случае реорганизации или расформирования группы Исполнитель предоставляет Заказчику возможность продолжения обучения: переход в группу аналогичного уровня либо индивидуальные занятия по тарифу индивидуальных занятий.
                        4.6. Стороны признают, что с момента окончания оказания Услуг, Услуги Исполнителя по договору Оферты считаются оказанными полностью и подлежащими оплате в полном объеме, а договор Оферты прекращает своей действие.

                    </p>



                    <p>
                        5. Обязанности и права Заказчика <br />
                        5.1. Заказчик обязуется в соответствии с условиями настоящей Оферты, оплатить и принять Услуги Исполнителя по договору Оферты.
                        5.2. Заказчик обязуется выполнять все требования, изложенные в настоящей Оферте.
                        5.3. Заказчик не имеет права передавать свои права по Договору Оферты какой-либо третьей стороне.
                        5.4. Заказчику запрещается распространять (публиковать, размещать на Интернет-сайтах, копировать, передавать или перепродавать третьим лицам) в коммерческих или некоммерческих целях предоставляемую Исполнителем Заказчику информацию и материалы в рамках настоящего Договора, создавать на ее основе информационные продукты, а также использовать эту информацию каким-либо иным образом, кроме как для личного использования.

                    </p>

                    <p>
                        6. Ответственность сторон
                        <br />
                        6.1. За невыполнение или ненадлежащее выполнение обязательств по настоящей публичной Оферте Стороны несут ответственность в соответствии с действующим законодательством.
                        6.2. Исполнитель не несет ответственности за невозможность обслуживания Заказчика по каким-либо причинам, включая нарушение работы линий связи, неисправность оборудования и т.п., в данном случае услуга оказывается в иное согласованное сторонами время.
                        6.3. Исполнитель не несет ответственности за отсутствие у Заказчика необходимых профессиональных навыков или иных знаний, необходимых для качественного использования полученных информационных материалов.
                        6.4. Исполнитель не отвечает за реальный ущерб и/или упущенную выгоду, понесенные Заказчиком вследствие использования или невозможности использования услуг Исполнителя.
                        6.5. Не вступая в противоречие с указанным выше, Исполнитель освобождается от ответственности за нарушение условий договора Оферты, если такое нарушение вызвано действием обстоятельств непреодолимой силы (форс-мажор), включая: действия органов государственной власти, пожар, наводнение, землетрясение, другие стихийные действия, отсутствие электроэнергии и/или сбои работы компьютерной сети, забастовки, гражданские волнения, беспорядки, любые иные обстоятельства, не ограничиваясь перечисленным, которые могут повлиять на выполнение Исполнителем договора Оферты.
                        6.6. Заказчик несет всю ответственность за достоверность сведений, указанных им при оформлении Заявки на информационно-консультационное обслуживание и платежных документов при оплате Услуг Исполнителя.
                        6.7. Договор Оферты, его заключение и исполнение регулируется в соответствии с действующим законодательством Украины.
                        6.8. Все споры и разногласия решаются в соответствие с действующим законодательством.
                    </p>


                    <p>
                        7. Ответственность сторон
                        <br />
                        7.1 Исполнитель и Заказчик, принимая во внимания характер оказываемой услуги, обязуются в случае возникновения споров и разногласий, связанных с оказанием информационно-консультационных услуг на Украинском маркетинг-форуме, применять досудебный порядок урегулирования спора. В случае невозможности урегулирования спора в досудебном порядке, стороны вправе обратиться в Украинский суд.

                        7.2 За неисполнение либо ненадлежащее исполнение обязательств по настоящей Оферте, стороны несут ответственность в соответствии с законодательством Украины.


                        <br />
                        Card сurrency - USD

                    </p>

                    <p>
                        7. РАЗРЕШЕНИЕ СПОРОВ
                        <br />
                        7.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта Интернет-магазина и Администрацией сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).

                        7.2 .Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.

                        7.3. При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Украины.

                        7.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство Украины.
                    </p>


                    <p>
                        8. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
                        <br />
                        8.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.

                        8.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте интернет-магазина, если иное не предусмотрено новой редакцией Политики конфиденциальности.

                        8.4. Действующая Политика конфиденциальности размещена на странице по адресу www. адрес магазина.
                    </p>
                    Контакты
                    <br />
                    Контакты для вопросов о настоящей Политике конфиденциальности:
                    <br />
                    г. Киев
                    <br />
                    Обновлено 2 января 2022 г.
                </div>
            </Section>
        </Wraper>
    )
}