import { Section } from "../../usableComponents/Section"
import { Wraper } from "../../usableComponents/Wraper"
import s from './Politic.module.scss'

export const Politic: React.FC = () => {
    return (
        <Wraper>
            <Section>
                <div className={s.wrap}>
                    ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ
                    <br />
                    <p>

                        г. Киев <br />                                   10.11.2021.
                        <br />
                        Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт getready4ieltsandtoefl,

                        расположенный на доменном имени адрес магазина, может получить о Пользователе во время использования сайта и продуктов.
                    </p>


                    <p>
                        1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ

                        <br />

                        1.1 В настоящей Политике конфиденциальности используются следующие термины:

                        1.1.1. «Администрация сайта (далее – Администрация сайта) » – уполномоченные сотрудники на управления сайтом, которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.

                        1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).

                        1.1.3. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.

                        1.1.4. «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.

                        1.1.5. «Пользователь сайта Интернет-магазина (далее ? Пользователь)» – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт интернет-магазина.

                        1.1.6. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.

                        1.1.7. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.

                    </p>

                    <p>
                        2. ОБЩИЕ ПОЛОЖЕНИЯ
                        <br />
                        2.1. Использование Пользователем сайта означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.

                        2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта Интернет-магазина.

                        2.3 Настоящая Политика конфиденциальности применяется только к сайту getready4ieltsandtoefl. Сайт не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте.

                        2.4. Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта.


                    </p>


                    <p>
                        3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ
                        <br />
                        3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при оформлении заказа для приобретения Товара.

                        3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы на Сайте getready4ieltsandtoefl и могут включать в себя следующую информацию:

                        3.2.1. фамилию, имя, отчество Пользователя;

                        3.2.2. контактный телефон Пользователя;

                        3.2.3. адрес электронной почты (e-mail);


                        3.3. Сайт защищает Данные, которые автоматически передаются в процессе просмотра рекламных блоков и при посещении страниц, на которых установлен статистический скрипт системы ("пиксель"):

                        IP адрес;
                        информация из cookies;
                        информация о браузере (или иной программе, которая осуществляет доступ к показу рекламы);
                        время доступа;
                        адрес страницы, на которой расположен рекламный блок;
                        реферер (адрес предыдущей страницы).

                        3.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта Интернет-магазина, требующим авторизации.

                        3.3.2. Интернет-магазин осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.

                        3.4. Любая иная персональная информация неоговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.
                    </p>


                    <p>
                        4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ
                        <br />
                        4.1. Персональные данные Пользователя Администрация сайта может использовать в целях:

                        4.1.1. Идентификации Пользователя, зарегистрированного на сайте, для оформления заказа и (или) заключения Договора купли-продажи товара дистанционным способом с getready4ieltsandtoefl.

                        4.1.2. Предоставления Пользователю доступа к персонализированным ресурсам Сайта getready4ieltsandtoefl.

                        4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта интернет-магазина, оказания услуг, обработка запросов и заявок от Пользователя.

                        4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.

                        4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.

                        4.1.6. Обработки и получения платежей, подтверждения налога или налоговых льгот, оспаривания платежа, определения права на получение кредитной линии Пользователем.
                    </p>



                    <p>
                        5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ
                        <br />
                        5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.

                        5.2. Пользователь соглашается с тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на Сайте getready4ieltsandtoefl.

                        5.4. При утрате или разглашении персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.

                        5.5. Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.

                        5.6. Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.
                    </p>

                    <p>
                        6. Права и обязанности сторон
                        <br />
                        6.1. Пользователь вправе:

                        6.1.1. Принимать свободное решение о предоставлении своих персональных данных, необходимых для использования сайта getready4ieltsandtoefl- Технический взлет онлайн бизнеса, и давать согласие на их обработку.

                        6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.

                        6.1.3. Пользователь имеет право на получение у Администрации информации, касающейся обработки его персональных данных, если такое право не ограничено в соответствии с законами. Пользователь вправе требовать от Администрации уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав. Для этого достаточно уведомить Администрацию по указаному E-mail адресу.

                        6.2. Администрация обязана:

                        6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.

                        6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. настоящей Политики Конфиденциальности.

                        6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.

                        6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.

                    </p>


                    <p>
                        7. ОТВЕТСТВЕННОСТЬ СТОРОН
                        <br />
                        7.1. Администрация сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.

                        7.2. В случае утраты или разглашения Конфиденциальной информации Администрация сайта не несёт ответственность, если данная конфиденциальная информация:

                        7.2.1. Стала публичным достоянием до её утраты или разглашения.

                        7.2.2. Была получена от третьей стороны до момента её получения Администрацией сайта.

                        7.2.3. Была разглашена с согласия Пользователя.
                    </p>

                    <p>
                        8. РАЗРЕШЕНИЕ СПОРОВ
                        <br />
                        8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта Интернет-магазина и Администрацией сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).

                        8.2 .Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.

                        8.3. При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Украины.

                        8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство Украины.
                    </p>


                    <p>
                        9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
                        <br />
                        9.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.

                        9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте интернет-магазина, если иное не предусмотрено новой редакцией Политики конфиденциальности.

                        9.4. Действующая Политика конфиденциальности размещена на странице по адресу www. адрес магазина.
                    </p>
                    Контакты
                    <br />
                    Контакты для вопросов о настоящей Политике конфиденциальности:
                    <br />
                    г. Киев
                    <br />
                    Обновлено 2 января 2022 г.
                </div>
            </Section>
        </Wraper>
    )
}